{
  "main": {
    "name":"Joshua Currie",
    "description":"Software Developer based out of Mississauga. Currently, I work for Paybright as a Full-Stack Development focusing on .NET Core API's",
    "image":"profilepic.jpg",
    "bio":"Passionate software developer with 3 years of full-time development experience with a knack for picking things up quickly. I love learning and expanding current skills and thrive in environments that skill building and growth. I have interest in greenfield development environment's and am currently interested in  .NET Core API development.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "jmojcurrie@gmail.com",
    "phone": "647-233-2092",
    "github":"https://github.com/joshCurrie/",
    "project":"test project",
    "address":{
      "street":"Mississauga",
      "city":"",
      "state":"Ontario",
      "zip": "L5C 4E8"
    },
    "website": "none",
    "resumedownload":"resume here",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/curriejoshua/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/joshCurrie/",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here are a couple of skills I have picked through-out my full-time work and internships.",
    "education":[
      {
        "school":"University of Waterloo",
        "degree":"Bachelors of Computing and Financial Management",
        "graduated":"August 2019",
        "description":"Here I laid a foundation of knowledge for computer science and development. Relevant course work included courses on software design principals, specifically Singleton, MVC, and Factory design patterns, along with in-depth language specific material involving memory managment in Java, C++, and C."
      }
    ],
    "internships": [],
    "work":[
      {
        "company":"Paybright",
        "title":"Software Developer ",
        "years":"September 2019 - Present",
        "description":"The majority of my time at Paybright I have been a swiss army knife of a developer. I have been apart of many new greenfield development initatives that have been introduced since I started. These projects include creating from scratch Paybright's REACT component library, creating Paybright's first .NET Core API's, and the integration with Paybright's partner EasyFinancial. \n\n Being a swiss army knife has opened up many learning opportunities for myself. Recently I have been focused on learning and developing in .NET Core, specifically .NET Core API development. Noteably, I created the standards for Paybright's .NET Core versioning. Which included research into the industry standard for versioning to create a proof of concept and prototype. These standards will be used to help transition Paybright into their Target State Architecture.\nCurrently, I am apart of Paybright's Credit guild, which involves becoming the subject matter experts on everything credit in our code base. As Paybright grows and expands, my team has been tasked with managing our Credit solution. This includes managing our internal credit models, while ensuring integrations with 3rd party credit bureaus are fast and secure. "
      }
    ],
    "skills":[
      {
        "name":".NET Core",
        "level":"55%"
      },
      {
        "name":"C#",
        "level":"70%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"HTML",
        "level":"90%"
      },
      {
        "name":"JAVA",
        "level":"50%"
      },
      {
        "name":"MVC",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Ontario Gradebook",
        "category":"(MVP Only) A Meteor Single-Page application design for Ontario Teachers",
        "image":"ontariogradebook.png",
        "url":"https://ontariogradebook.ca/"
      }
    ]
  }
}
