{
  "main": {
    "name":"Joshua Currie",
    "description":"Software Developer based out of Mississauga. Currently, I work for Paybright as a Full-Stack Developer focusing on .NET Core API's",
    "image":"profilepic.jpg",
    "bio":"Passionate software developer with 3 years of full-time development experience with a knack for picking things up quickly. I love learning and expanding current skills and thrive in environments that skill building and growth. I have interest in greenfield development environment's and am currently interested in  .NET Core API development.",
    "contactmessage":"If you have any suggestions or questions and would like to get in contact with me, please send me a message!",
    "email": "jmojcurrie@gmail.com",
    "phone": "647-233-2092",
    "github":"https://github.com/joshCurrie/",
    "linkedin": "https://www.linkedin.com/in/curriejoshua/",
    "project":"test project",
    "address":{
      "street":"",
      "city":"Mississauga",
      "state":"Ontario",
      "zip": "L5C 4E8"
    },
    "website": "none",
    "resumedownload":"resume here",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/curriejoshua/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/joshCurrie/",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here are a couple of skills I have picked through-out my full-time work and internships.",
    "education":[
      {
        "school":"University of Waterloo",
        "degree":"Bachelors of Computing and Financial Management",
        "graduated":"August 2019",
        "description":"Here I laid a foundation of knowledge for computer science and development. Relevant course work included courses on software design principals, specifically Singleton, MVC, and Factory design patterns, along with in-depth language specific material involving memory managment in Java, C++, and C."
      }
    ],
    "internships": [
      {
        "company": "Blackberry",
        "city": "Mississauga",
        "title": "Security Software Developer",
        "years": "September 2018 - April 2019",
        "description": "During my 8 months at Blackberry I was solely focused on learning and picking up any new skills I could acquire. I worked very closely with BlackBerry's Java Cryptography Architecutre (BBJCA), specifically I made changes attempting to move BBJCA closer to compatability with Android's JCA library, while writing throughly thought-out unit-test cases. I also got experience writing Android.bp files while modifying an internal legacy toolkil, PKI-C."
      },
      {
        "company": "InteraXon",
        "city": "Toronto",
        "title": "iOS App Developer",
        "years": "January 2018 - April 2018",
        "description": "At InteraXon, I was brought-in as a FE developer, with no experience in Swift and building Apps. I quickly learnt and became literate in the langauge of App development. My time at InteraXon was mostly filled with developing front-end screens using a mixture of Storyboard and Swift, using a layer of C++ to communicate to and from the app's cloud service. I got to learn about Model-View-ViewModel design patterns, and wrote code strictly following this pattern."
      },
      {
        "company": "Milliman",
        "city": "Chicago",
        "title": "Software Developer",
        "years": "May 2017 - August 2017",
        "description": "At Milliman, I was tasked with developing a two-factor authentication windows service from scratch. It was my first, 'big-projcet' as an intern, and I was left to gather requirements, develop prototypes, while helping fellow interns along the way. For this 2FA application, we utilized Twilio, a 3rd party messaging service, to send messages and calls, while utilizing SQL to store any data we needed to facilitate the 2FA. We made use of the powers of C#, implementing interfaces to provide a level of abstraction which would make modifications and additions easier in the future. Although, in hindsight, I wish I prioritized unit-tests much more. Unit-tests were which I learnt a great deal about towards the end of my 4-month tenure at Milliman."
      },
      {
        "company": "Leonardo Worldwide Corporation",
        "city": "Toronto",
        "title": "Front End Developer",
        "years": "September 2016 - December 2016",
        "description": ""
      },
      {
        "company": "D + H",
        "city": "Mississauga",
        "title": "Software Developer Co-Op",
        "years": "January 2016 - April 2016",
        "description": ""
      }
    ],
    "work":[
      {
        "company":"Paybright",
        "title":"Software Developer ",
        "years":"September 2019 - Present",
        "description1":"The majority of my time at Paybright I have been a swiss army knife of a developer. I have been apart of many new greenfield development initatives that have been introduced since I started. These projects include creating from scratch Paybright's REACT component library, creating Paybright's first .NET Core API's, and the integration with Paybright's partner EasyFinancial.",
        "description2": "Being a swiss army knife has opened up many learning opportunities for myself. Recently I have been focused on learning and developing in .NET Core, specifically .NET Core API development. Noteably, I created the standards for Paybright's .NET Core versioning. Which included research into the industry standard for versioning to create a proof of concept and prototype. These standards will be used to help transition Paybright into their Target State Architecture.",
        "description3": "Currently, I am apart of Paybright's Credit guild, which involves becoming the subject matter experts on everything credit in our code base. As Paybright grows and expands, my team has been tasked with managing our Credit solution. This includes managing our internal credit models, while ensuring integrations with 3rd party credit bureaus are fast and secure."
      }
    ],
    "skills":[
      {
        "name":".NET Core",
        "level":"55%"
      },
      {
        "name":"C#",
        "level":"70%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"HTML",
        "level":"90%"
      },
      {
        "name":"JAVA",
        "level":"50%"
      },
      {
        "name":"MVC",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title": "Paybright",
        "category": "An e-commerce pay-over-time platform",
        "image": "paybright.jpg",
        "url": "http://paybright.com"
      },
      {
        "title":"Ontario Gradebook",
        "category":"(MVP Only) A Meteor Single-Page application design for Ontario Teachers",
        "image":"ontariogradebook.png",
        "url":"https://ontariogradebook.ca/"
      }
    ]
  }
}
